import time
superdict = {
'page1':'''嘿，终于盼到放暑假了，到表姐弟卡琳和汤姆的新家去串门那该有多棒。远远地，就看到夏洛蒂姨妈，她是专程来长途车站接你的。一下车，姨妈便冲过来拥抱你，弄得你喘不上气来。可是，她高兴的表情中还含有一丝忧虑，到底有什么不妥呢？
在你们去她家的路上，心里装不住事的姨妈开口说：“听说了吗？昨天，警察发现了一具尸体，那地方离我们家只有半里远！”
“是吗，太可怕了！是被谋杀的吗？”你问。“不太清楚，据说，死尸上有牙印儿，又大又深，像狗咬的，可是，长着那种锯齿的狗我可没见过！”
“真是怪事。”你说。
姨妈减慢车速，“可不是吗，”她说，“我已经把这件事告诉汤姆和卡琳了，现在，我得跟你说，去哪儿都必须万分小心，还有，千万别单独外出。”

请输入数字2。
''',

'page2':'''“知道了。”你嘴里应承着，心里却好奇得要命。
一会儿，车又拐上了平坦的公路，最后，停靠在一幢小楼房前，它被白色的篱笆围着，四周青松翠柏掩映。夏洛蒂姨妈得意地瞟了你一眼：“这就是我们家，印象如何？”
“蛮好的。”你回答道。心里却觉得房子有点旧，应该重新刷一遍漆。大门不太明显，进门时，你看见那儿有几把摇椅和一张吊床，一只乌鸦呱呱地叫着，让人有种不祥的感觉。
姨妈带路，你拎着行李跟在后面，当你们进屋时，卡琳飞快地奔下楼来，汤姆紧随其后。
“嗨！”卡琳向你致意，一下抱住了你。
正在这时，电话铃响了，姨妈赶去接电话，他俩带你去你住的房间。你把行李往床上一扔，匆匆洗了把脸，就赶去看卡琳姐弟俩。

请输入数字3。
''',

'page3':'''“妈妈告诉你了吗？”你一进来，汤姆马上就问。
“是谋杀的事儿吗？”
“是，而且还有嫌疑犯呢。”卡琳说。
“没有，这可没说。警察查出这是谁干的了吗？”
汤姆和卡琳交换一下眼神。“还不能确定，”卡琳说，“他们认为，住在这儿的人不会做出这种事情。”
“你妈妈还说，尸体上有特大的压印儿。”
“那真是太可怕了，”卡琳惊叫起来，“杀人犯说不定是个狼人或者其他的什么东西。”

请输入数字4。
''',

'page4':'''汤姆说：“我们来调查一下这件事，怎么样？”这时，你注意到书架上的一本厚书，书名叫《世界奇闻百科全书》。这本书非常旧，好像一翻就会散架子。你很小心地从书架上把它拿下来。
你查阅着，最后找到字母“W”。“这有‘werewolf’，狼人！”你喊道。
汤姆和卡琳都过来了。汤姆问：“上面怎么说的？”
你大声宣读：

 狼人：是一个被变成狼的人，外表和行为都像一个人。没人知道这是怎么回事儿。但是狼人既强壮又危险，尤其是在它饥饿的时候，这一点确信无疑。某些专家认为一个女巫或许能够杀死狼人，也许我们常人也能制服狼人，但这种尝试是一种不明智的举动。对付狼人的最好办法就是离它越远越好。

“听得我直发抖。”卡琳说。

请输入数字5。
''',

'page5':'''“这就是我要查出事情真相的原因，”汤姆说，“我想去一趟保罗丁池塘，就是出事的那地方。”
“警察已经去过了。”卡琳说。
“再去一次也没什么坏处，”她弟弟说道，“我们或许会发现他们遗漏的什么线索。”
“你乐意去就自个儿去，反正我是不去，”卡琳说，“我有一个好主意。我打算顺路去哈德利小姐谈谈，或许她以前见过这种怪物。”
“是那个老疯子吧！”汤姆以嘲弄的口吻说。
“就是那种人才有可能清楚狼人呢。”卡琳平静地回答。
汤姆看着你。“那好吧，我可是要去池塘那边了，一块儿去吗？”
“还是和我一块儿去找哈德利小姐谈谈吧。”卡琳劝你说。

如果你决定与卡琳去拜访哈德利小姐，请输入数字18；
如果你决定与汤姆去查池塘，请输入数字31。
''',

'page18':'''“我想听听哈德利小姐能说些什么，”你告诉汤姆，“来，卡琳，我们走吧。”
几分钟后，你和卡琳来到哈德利小姐的房子前，这座小房子位于森林的边缘，坐落在绿草茵茵的小土坡上。你们敲了敲门。等了一会儿， 没人开门。
你看了看周围，太阳已经快落山了，地面上映着长长的树影。
“她总是在家的，”卡琳说，“我想她是个聋子。”她开始猛力地敲门，你也跟着敲了几次。
 终于，窗户后面出现了一张脸。过了一会儿，出来一个老太太，长长的白头发，瘦瘦的脸，还有一双似乎能看穿一切的蓝眼睛。她死死地盯着你，然后发出一种尖锐刺耳的声音：“孩子们，你们要干什么？吵死了！”
“我们想打听一下，最近，您在附近看见过奇怪的东西吗？比如，一个不可思议的人，或者是一种生物什么的？”卡琳问。
哈德利小姐本来就紧锁着的眉头，现在变得更加凝重。“你们看到过什么了？”她探寻着。

请输入数字13。
''',

'page13':'''“没有，”卡琳说，“但警察在保罗丁池塘边发现了一具尸体。上面有大牙印儿，像狼咬的，伤口很深。”
哈德利小姐大张着嘴，睁大了眼睛，向后退了一步。“谋杀？千真万确！”她的目光显得有些茫然，像是若有所思的样子，迟疑了一会，她说：“孩子们，你们还是进屋吧，我打算告诉你们一些事。”
你和卡琳跟着哈德利小姐走进她的起居室，那屋子又狭小又古怪。墙角堆放着许多木箱子；还有一个老掉牙的钟，已经好久没用的小壁炉。起居室后面的门直接通道厨房。看上去整个房子就这两间屋。
屋里没有床，天知道哈德利小姐在哪儿睡觉。
老太太坐在桌旁，从台子上拿来一壶茶，打算告诉你们一些你们关心的事情。她倒好茶后，坐在你们前面一边喝着茶，一边从杯子边儿看着你们。茶味怪怪的，像有一股烂花叶的味道。

请输入数字21。
''',
'page21':'''“我从哪儿说起呢？”哈德利小姐说，“我从不想谈论这件事，但我想现在是时候了。”她眯起眼睛，抿着嘴，便死死地盯着你，而你在椅子里缩成一团。
“多年以前，”她说，“有一个男人住在你们家后面的林子里。那儿有一间小棚子。人们都认为他住在里面，但从不曾有人见过他。”
“你见过他吗？”你问。
她点了点头，然后，往她的杯子里放了更多的怪味茶。“也就那么一次。他长着乱蓬蓬的短胡子，头发又短又硬，一张尖尖的脸上，长着一个长得快到下巴的鼻子。”
卡琳问：“那他有嘴吗？”

请输入数字16。
''',
'page16':'''“噢，他有嘴，真的，”哈德利小姐提高嗓门，“还有上下颚。我只记得这些了。当时，我正在花园里，我看见他正从林子中盯着我看，就好像我是盘子里的牛排。我心里很不高兴。心想：‘总有一天，他会为此后悔的！’”她侧过身，凑近你们：“孩子们，你们会明白的，我已经开始使用我的特殊力量！”
她这一番话令人莫名其妙，你不由回想起汤姆说过的哈德利小姐是个疯子的话。
“那，那房子原来是谁的呢？”卡琳问。
“罗杰·克兰默尔先生。”正说着，一只暹罗猫蹿到桌子上。它瞪着灰蓝色的眼睛，冷冷地看着你。
“你认识克兰默尔先生吗？”你问。
“认识，但不熟，他经常除外旅游。”哈德利小姐说着，拍了一下她的猫，“有天，他在自己的床上被人谋杀了。”卡琳睁大了眼睛，哈德利小姐继续说：“因为他好几天没有去上班，他的尸体才被警察发现的。”

请输入数字28。
''',
'page28':'''哈德利小姐顿了一顿，说：“你们还是孩子，我不想跟你们描述他当时的样子。”
“告诉我们吧！”卡琳说道，“我们已经是大人了。”
“我们在电视上都见过。”你补充说。
她的脸上掠过一丝古怪的笑：“好吧，要是你们真有兴趣，我就告诉你们，他的脖子跟双肩都被爪子抓破了，好像是某种动物……”
卡琳紧张得直喘气。“就像他们在池塘边发现的尸体一样吗？”
“抓住罪犯了吗？”你问道。
哈德利小姐摇了摇头。“他们为了找他，彻底搜查了林子。还检查了尖脸人住的小棚屋。里面到处都是骨头，有兔子的，狗的，甚至还有……”
“人的？”你马上插嘴。
“对了，人的。”她笑了，她似乎很欣赏这个看法。“这不是普通的罪犯，”她说，“是一个狼人！”

请输入数字64。
''',

'page64':'''“噢！”你说，“现在，他回来了！”
“又一顿饱餐。”卡琳补充道。
你心里想，肯定不止一顿。
“嘘——，看你，都吓破胆了。”卡琳说。
哈德利小姐诡秘地笑了一下，又换了一副和善的面孔，这反倒令她显得阴森森的。“不错，我很害怕，怕得发狂了。”她提高了声音，“就为这，人们说我是疯子。咳，咳，咳。但是，虽然我失去了理智，但我也有所得，我有许多别人没有的本事，我的小甜心，我能做些你们无法想象的事情！”
卡琳看上去被吓坏了。“我们回家吧。”她显得很紧张。
你向窗外看。黑云遮住了天空的最后一丝光亮。
“对，你们该回家了，”哈德利小姐说，“尤其是漂亮的小孩更不该单独出门了，特别是天黑以后。”

请输入数字73。
''',
'page73':'''
她的声音和眼神，令你浑身发冷。但是，你可不想示怯，到底是打电话让夏洛蒂姨妈来接你们呢？还是勇敢地自己走回家呢？你踌躇着。

如果你告诉卡琳，让她给妈妈打电话，让她来接你们，请输入数字23；
如果决定走回家，请输入数字10。
''',
'page23':'''在你的催促下，卡琳给妈妈打了电话，过了几分钟，她来接你们。在回家的路上，你把哈德利小姐说的，一五一十地告诉了她。她边听边笑。
“狼人？简直荒谬绝伦。艾伦·哈德利的疯病真是越来越严重了。编造那种故事都是想吓唬你们。她应该为自己感到害臊。不过，她可不会这样想。她脾气古怪，我看她可是越老越怪了。”夏洛蒂姨妈把车开上车道，一直把你们拉到家才停下来。你和卡琳一起跟着她走进房子。
“汤姆。”她喊道。没人回答。
“他去保罗丁池塘了，就是发现尸体的地方，”卡琳说，“我想他还没回来。”
姨妈一下子变了脸色，现出很吃惊的神情，“天快黑了，随时都会下雨。”她忧心忡忡地说。

请输入数字71。
''',
'page71':'''“汤姆去了那儿，我真是有些担心。我得马上去那儿找他。你俩在家呆着，我去去就来。”
她关上门。不一会儿，传来她发动汽车的声音。
整幢房子突然变得死一样的沉寂。你从厨房的窗户外望去。天空中阴云密布，过了一会儿，一轮圆月从云隙间露出脸来，倏忽之间，又被云遮住了。就在这时，远远传来一声嚎叫，听上去绝不是狗吠，而像是人的哭泣声。
“啊喔啊喔……”
卡琳猛地靠紧你，手死死地抓住你的肩。
“这是什么声音？”她紧张地问。
“我也不知道，”你回答说，“好像是只狼。”
“啊喔啊喔……”可怕的声音又响起来了，这次听起来似乎更近了。

请输入数字67。
''',
'page67':'''没多久，一道闪电划破天空，又打了个炸雷，一场暴雨即将来临。随即，窗外电闪雷鸣，就在这时，一阵敲门声又吓坏了你俩一跳。
你和卡琳不敢去开门，便跑到楼上，把头探出窗外看是谁在敲门。尽管天黑漆漆的，但大门口的情况仍能一清二楚。可是，那儿什么也没有。
“啊喔啊喔……！”狼人的嗥叫声又来了，这次可是从楼下的屋里传来的！
卡琳恐惧地拽住你的胳膊：“天哪！门没锁！”

请输入数字14。
''',
'page14':'''她话音未落，你已听到一阵“啪啪”的声响，是谁在爬楼梯吗？脚步怪怪的，像是肉垫拍在楼板上。
卡琳叫道：“我们去把床挪过来，堵住大门！”“嗷，……嗷……！”声音越来越近了！
你尖叫道：“床挡不住它！我们得想个法子逃出去，看见吗，那儿有棵树，我们应该跳到树上，再滑到地上。”
卡琳一边忙着挪床，一边说：“那棵树距离太远啦，我们够不着，快，帮把手，别傻愣着。”

如果你想帮卡琳堵门，请输入数字29；
如果你坚持要跳到树上，请输入数字12
''',
'page29':'''你飞快地跑过去，帮卡琳把床从墙边挪出来，然后，你俩绕到床后面，合力把床向门那边去推。
这时，从走廊里传来一种声音，听上去不是吼叫声，而是一个低沉而沙哑的嗥叫声。接着，传来了脚步声，就在门口，那脚步戛然而止。就在这一刹那，你俩成功了，正好把床塞在门和衣橱之间。几乎同时，门上发出了重重的捶击声，一下接着一下。接着，是一声震耳欲聋的嗥叫！
“砰！”门闩断了。门只被推开几英寸的缝儿，就被床框儿挡住了。透过门缝，只见一个黑黑的鼻子，一张带着毛的嘴，真的是一个狼人！它继续用力撞着门。
“砰！砰！砰！”你和卡琳退到墙角，吓得缩作一团，门一次次猛撞着床框。这回狼人真的发怒了！
过了一会儿，它不砸了。你听见狼人正在走廊嗥叫着，喘着粗气，像是想歇一会儿。不久，它又开始使劲地撞着门板，门缝儿越来越大了。又是“砰”地一声，门缝儿更大了！

请输入数字42。
''',
'page42':'''“他要进来了！”你冲卡琳喊，“我们得赶快跳到树上去！”
她快速爬上窗台，随即又停住了——窗户和树之间足足有两大步远。
雨还在下着，不时有闪电划破夜空，接着，雷声隆隆。“你能行，”你喊。“快！用胳膊和腿盘住树干，然后向下滑！”
她尖叫着跳下去。正好抓住树干，开始向地面滑下去，你也立即爬上窗台。
身后传来可怕的“嘎吱嘎吱”的声音。床框一定被击碎了，门一定开了。你回头望：一个一身灰斑的巨人一样的家伙向你普过啦i，他张着血盆大口，鲜红的长舌头从那獠牙中伸出来。
来不及多想了，你不顾一切地向外跳去，重重地落在树上，鼻子撞得生疼。然后，你使劲用胳膊和腿攀住树干，向下滑，转眼间就滑到了地面，差点儿撞着正在地上揉脚的卡琳，这前前后后只不过是一两秒的时间。

请输入数字36。
''',
'page36':'''你俩惊魂未定，喘着粗气。正在此时，两道汽车的灯光照亮了路面，啊！夏洛蒂姨妈和汤姆回来了。卡琳向汽车跑去，打开后车门，上了车，你也跟着挤了上去。
夏洛蒂姨妈笑了。“嗨，我们去哪儿？”
“我们必须马上走，”卡琳摇着头说。“嘘——”
“你鼻子出血了！”姨妈打断了她的话，看着你，递给你一些棉纸。问：“发生了什么事？”
“看！”当一个闪电划过天空时，汤姆喊。
“噢，我的天哪！”夏洛蒂姨妈惊叫起来。狼人正在房檐下，顿时，恐惧袭遍大家全身。闪电过后，仍是一团漆黑，黑暗中，你听见一声悠长而凄厉的嗥叫。

请输入数字6。
''',
'page6':'''“妈妈，它刚才闯进我们家了！”卡琳喊着。“眼看它就要进入我的房间了，我们只好跳窗户了！”她坐在汤姆后面的座位上，身体向前倾。夏洛蒂姨妈转过身来，安慰地搂了她一下。“现在没事儿了，宝贝儿。”她掉转车头，开上公路，然后，又拐向一条小路。

“我们去哪儿，妈妈？”汤姆问。

“还能去哪儿，去警察局。”夏洛蒂姨妈说着，猛地一个急转弯，把你摔向门边。

一个小时以后，你们又回到夏洛蒂姨妈家，这次带来了一名警察。此刻，暴雨已经停了。

州警察进了屋，开始仔细勘察痕迹，寻找那个奇怪的闯入者。

你们把警察领到楼上来，让他看看卡琳的房间。狼人捶打过的门已经破烂不堪了，卡琳的窗框被扒开一个大口子，刚好够狼人能进来的宽度。

警察摇着头说：“我们会抓到它的，我向你们保证。”

请输入数字19。
''',
'page19':'''“你们警察就会说大话。”姨妈说，“天知道那是‘人’，还是只‘动物’。”
警察眯起眼睛，看着姨妈。“好，不管它是‘人’，还是‘动物’，头儿认为它可能还会来，他叫我在这儿呆一个晚上，监视一切动静，但不要让人走进卡琳的房间。过一会儿，侦探会来这儿，取指纹。”
“指纹？应该说是爪子印。”你想。
“你到备用房间去睡，好吗？”夏洛蒂姨妈一边搂着卡琳，一边说。“你的房间得修整一下，宝贝儿。”
警察在厨房里喝咖啡。其余的人都聚在起居室，谈论发生过的事情。
夏洛蒂姨妈拿起电话，拨了个号码。等了一会儿，她挂了，看上去有点儿担心。“我想找哈德利小姐，告诉她关好门窗，可是没人接。”

请输入数字45。
''',
'page45':'''“她可能出去了。”汤姆说。
“出去？我想，她晚上是不会出去的，”他母亲回答说。她又打开了一遍，仍没人接，这次，她可真的担心了。
“我跟警察说过，应该派人保护哈德利小姐。他们竟然说，没人可派，也不可能为镇子每一个人都排一名警察。”
“我看有点不妙……”你说。
“是的，”姨妈也说道。“哈德利小姐年纪大了，并且一个人生活，一定是出事儿了，要不她应该接电话，我得过去看看她。”
“我得去，”她说。“你们是想和我一起去呢，还是跟警察呆在家里呢？”

请输入数字66。
''',
'page66':'''“我和你一起去，”汤姆说，“我得保护你。”
“我也保护你。”卡琳说。
夏洛蒂姨妈笑了，露出了雪白的牙齿，抚摸着你的肩，问：“你想跟我们一起去，还是留下来？”

你如果也想去，请输入数字24。；
你如果决定呆在家里，请输入数字38。

''',
'page24':'''“我当然也要去凑凑热闹，”你说。
你、汤姆和卡琳一起挤进汽车。几分钟后，你们就到了哈德利小姐的小屋前，四周漆黑一片，只从厨房里透出一点亮儿。
“你们老老实实呆在车里，把车门锁了。”夏洛蒂姨妈说。
“遵命就是了。”汤姆应着。但他突然打开车门，跃出来，你和卡琳也迅速从另一边跃出来。
“好吧，”夏洛蒂姨妈说，“真是拗不过你们，不过我们要呆在一起，不许分开，紧挨着我。”
你们都跟着她来到小屋门前，她嘭嘭地使劲叩门，却没人开门。
“她是聋子吧？”汤姆说。
“也许她不敢开门。”你说。
“哈德利小姐！”夏洛蒂姨妈喊着，又继续叩门。
“我们从厨房的窗户往里瞧瞧，只有那儿有亮。”你说。
“跟着我，”夏洛蒂姨妈说，你们一行四人在房子的四周绕来绕去。

请输入数字8。
''',
'page8':'''“谁？”一声惊叫，从一扇窗子里传出来。
“是夏洛蒂！”你姨妈大声喊起来。“我们来看你，你还好吗？”
“好，但你们不该在别人房子周围绕来绕去的。”哈德利小姐回答道。
“对不起，”夏洛蒂姨妈说，觉得有点儿打搅了哈德利小姐。“我本不想——”
哈德利小姐打断了她的话。“你担心什么？你们要是好奇的话，就绕到厨房门这边来。”话音刚落，你们从厨房门进去了。
“来，你们看看这是什么，就知道我是否安然无恙了。”她手里正拿着茶杯，说话时，似乎余怒未消。
你们谁都没有吱声，一齐朝地上望去，只见地板上躺着一个家伙，它举着手，啊！那不是手和脚，而是爪子！
这个家伙浑身长满了毛，一张刀条脸湿乎乎的，黑黑的圆鼻子，长长的嘴半张着，露出了可怕的獠牙，这分明是狼人！

请输入数字17。
''',
'page17':'''究竟发生了什么事情？你从没见过这种场面！而更怪的是，这只狼人正在你面前慢慢地死去！它的嘴已经不听使唤了，浑身的毛也在慢慢地变少，似乎下面的骨头和肉也在慢慢地蒸发了。接着，这家伙的皮渐渐消失。地板上只剩下那些粗毛，留下一个躯体的轮廓。
不可能！你一定是在做梦！噢，你记起来了，百科全书曾记载过，摧毁狼人，只有一个办法。你瞧了瞧哈德利小姐，她的眼睛里闪着兽性的寒光，正在擦拭着双手。突然，她的猫跳到她的肩上，冷冷地盯着你。

请输入数字27。
''',
'page27':'''“你……你刚才做什么了？”夏洛蒂姨妈结结巴巴地问。
“是啊，到底怎么回事？”你也跟着问。老太太走过来，用她那骨节粗大、皱皱巴巴的手按住了你的嘴巴。一股凉意袭来，你不禁打了个冷战。接着，她走开了，但你还在抖，汤姆也跟你一样。
夏洛蒂姨妈呆呆地瞅着地板上的粗毛，似乎吓得动不了了。
“你看上去很冷，亲爱的，”哈德利小姐对你说道，“要杯茶吗？”
“不！”你大声说。
老人拍了拍夏洛蒂姨妈的肩。“你被吓坏了，对吗，亲爱的？你还替我担心呢！”她兽性发作一般地咯咯狂笑起来。
“喔，是的，我们挺担心的。”夏洛蒂姨妈说：“我们还以为……”她的声音已经不是调儿了。
“我们还以为它……”你指着地板，下半句怎么也说不出来了。

请输入数字65。
''',
'page65':'''“不过，现在，我看已没山么好担心的了。”夏洛蒂姨妈说。
哈德利小姐的眼神开始闪亮起来，射出来的光跟她的小猫咪一模一样。
她拿起茶壶，往她的茶杯里倒了更多的茶水。一种又怪、又恶心的苦味儿钻进你的鼻孔，这种味道，你从没闻过。
“是啊，已没什么课担心的了。”老太太用不慌不忙的语调说，“狼人之夜已成为过去，可这并不意味着你们就很安全了，现在……”
“现在怎么样？”你脱口而出，还没等老太太回答，夏洛蒂姨妈立刻从哈德利小姐身边跃过去，走向门，然后，拉开门。
她大口地呼吸着从外面吹进来的新鲜空气，转过身来说：“过来，孩子们。晚安，哈德利小姐。”
“现在会怎么样，哈德利小姐？”你又问。
“你知道了我的秘密！”哈德利小姐喊着。她的嘴角闪过一丝淡淡的、残酷的笑容，眼睛死死地盯住你，大骨节的双手一齐向你伸过来。就在这时，夏洛蒂姨妈拉起你的胳膊，又向卡琳和汤姆打了个手势，你们三个飞快地跟着夏洛蒂姨妈，逃出了门口。

请看输入数字74。
''',
'page74':'''“顺便谢谢你们，”哈德利小姐在身后喊道，“下次，我会去看你们！”你们飞快地向汽车跑去，身后，传来她咯咯的兽性发作般的笑声。
你们手忙脚乱地爬进车里，夏洛蒂姨妈立刻开始发动了引擎。
“简直不敢相信自己的眼睛！”汤姆说。
“嗯，还有自己的耳朵！”你补充道。
你们逃远后，夏洛蒂姨妈这才说：“我要不是亲眼看见，我也不会相信的。”
“我还是不信者是真的，”你说，“狼人的躯体在地板上……就那样消失了！”
“我觉得你该好点儿了，”她母亲告诉她，“我们不必再为狼人的出现而担忧了。”
“那倒是，”你所，“不过，现在我们又得当心那一个女巫了！”

''',
'page38':'''你决定呆在家里。现在，警察在这儿，你倒希望狼人能来。要是能在近处看看狼人，并亲眼看见它被抓，那该多好啊！
“从现在开始，你不准到房子外面去。”夏洛蒂姨妈走之前，告诉你，“你要是是听见奇怪的声音，一定要告诉警察。我们大约过10至15分钟就回家。你真的想留下来吗？”
“是，是真的。”
夏洛蒂姨妈和你的表兄妹的汽车顷刻间驶向公路。这时，你有点儿后悔，生怕有好戏把你落下。同时，你又有点儿紧张。狼人来了怎么办？即使家里有警察，他也不能随叫随到啊！
你试着看本书，但一点儿心思都没有，只好在房子里踱来踱去。最后，你停在窗前，凝望着黑暗，倾听着外面的动静。只是有蟋蟀轻轻地吟唱和一两辆汽车从公路上飞驰而过的声音。

请输入数字25
''',
'page25':'''你向厨房看去，那警察正坐在桌边，一遍喝着咖啡，一边看杂志。你心里想，和站岗的士兵真是不同。
他抬起头，问你：“需要帮忙吗，孩子？”
“不，”你说，“我只是有点心烦。”

请输入数字68
''',
'page68':'''“啊，放松点儿。不会有狼人来抓咱俩的。你去看电视，或者干点儿别的，怎么样？”
“好吧。”你转身离开。
但是，你觉得看电视还是没意思，因为平常都能看。夏洛蒂姨妈不让到外面的院子里，你可以去那个门厅嘛！你走出屋子，来到门厅里，关上灯，以便于你能适应黑暗。这样，狼人要是在房子四周徘徊，你就可以看见它了。
门厅里有一张吊床，一把柳藤编的躺椅，两把摇椅。你在吊床上躺了下来，吊床却讨厌地吱嘎吱嘎直响，你只好起来，坐在躺椅上。一轮圆月从云的后面钻出来，草坪上出现了一个怪异的影子。
你眯起眼睛，仔细端详，想知道那是什么。过了一会儿，只听一把摇椅上传来轻微的吱吱嘎嘎的声音。不知什么时候，那个警察也出来了。

请输入数字52
''',
'page52':'''有他在旁边，你心里踏实多了。
“暴风雨过去了，真好。”你说着，把手房子脑袋后面，那个警察没吱声。
“你在警察学院，学过怎样同狼人打架吗？”你想跟他开个小玩笑，可他不回答，你多么希望你姨妈和表兄妹快点回来呀。
又过了一会儿，“这儿可真静。”你说。那警察还是没有说话。“你能听见我说话吗？”你问道，不觉对警察的无礼感到有点儿怪。你起身向他坐的椅子走过去，只见他的徽章在月光下闪闪发光。
   “我说，你能听见我说话吗？”你又问了一遍，弯下腰，去看警察的脸，嗯？怎么是一张长满了毛的脸？！
   那个警察已变成狼人了！你得任由他摆布了！
   “你的每一句话，我都听得清清楚楚，”当你吓得直往后退时，他告诉你，邪恶地笑着，露出一口又尖又长的牙齿，“况且，我现在耳朵比以前大多了。”
''',
'page12':'''你说：“不，我们得赶快逃走！”你打开窗户，爬上窗台，并招呼卡琳：“快点吧，树就在跟前儿！”
“啊喔啊喔……”
狼人已经闯进了卧室！
它动作像闪电一样快，你都来不及看清它的模样。可那凄厉的嚎叫声却直撞耳膜。
“卡琳！随我来！”你着急地喊着，伸手去拉呆若木鸡的卡琳，可没够着。你慌乱地往树那边跳，可是，它太远了。你没抓住树枝，身子坠下去。你眼睁睁瞅着地面飞快地逼过来，脑子里一片空白。

请输入数字77
''',
'page77':'''你迷迷糊糊、半梦半醒，浑身像散了架子似的又酸又疼，这到底是怎么回事？
你躺在床上，眼望着雪白的天花板和暗绿色的墙壁，腿上打着石膏，高高地吊着。渐渐地，你开始回想起发生的一切。
有人在门口往里探了一下头，她是个护士。
“你觉得好点吗？”她问。
“糟透了，”你说，“我的表妹卡琳呢？她应该跟我在一起。”
“哦，你算问对人了。据我所知，你表妹在普通病房。她的伤势较轻，只是在额头上有一个咬伤，缝了八针。”
“她被咬了一口？”你惊异地问。
“是啊，”护士说，“我也不太明白是怎么弄的，我猜是一只大狗干的。”
''',
'page10':'''你和卡琳从哈德利小姐家出来，沿着路走着。一道闪电划过夜空，接着，远处雷声隆隆，暴风雨随时都会来临。但是你没心思想这些，只是一味地琢磨哈德利小姐的话，不知不觉，浑身发抖。一想起狼人，你就恨不得马上往家跑。但你不想让自己过于失态，只好加快了脚步。卡琳也加快了脚步，你想，她一定跟你一样，有同样的想法。
你路过通向保罗丁池塘的岔路口时，天已经差不多黑了，你只能看清一小段路，再往前看去就是一片黑暗了。突然，又是一个闪电。这一下，你们看见路上有两个人。一个看上去身形硕大，腰弯弯的，浑身长满了粗毛，而另一个是一个小男孩。

请输入数字37
''',
'page37':'''头顶响起了雷声，卡琳立刻抓紧你的胳膊。“是汤姆！”她喊，“跟狼人在一起！”
“你能肯定吗？”
“我自己的弟弟能不熟吗！”
“但……那个是狼人吗？”
“是！一定是他！”她快要哭了。又一个闪电，照亮了这两个人。
“汤姆！”卡琳喊。“汤姆！”雷声盖过了她的声音。
“汤姆！”
没人回答。
卡琳看着你，脸上是一幅吓坏的样子。她看上去着实吓得不轻，呆呆地站在那儿。这怎么能怪她呢？你想跑过去看汤姆，但又有些害怕。

如果你沿路跑过去看汤姆，请输入数字50；
如果你径自回家，请输入数字48
''',
'page50':'''“我想还是过去，看看会发生什么事儿？”你说着，沿着那条脏兮兮的小路跑过去，卡琳跟在你后头。
你们很快来到看见汤姆的地方，但是，连个人影儿都没有，没有汤姆，也没有狼人。这时，天已经黑了，朦胧的月光找着前面暗淡的路面。忽然，你又看见汤姆向你们跑过来，嘴里喊着什么，一声惊天动地的雷声淹没了他的喊声。

请看输入数字59
''',
'page59':'''接着，你又听见了他的喊声。“快跑！狼人抓住了我，但现在我逃走了！”说话间他已跑到你们跟前。这时，又是一道闪电，就在这一刹那间，你看见他的衣领上有血迹。
你们三人一起跑，你在前边领路。你们甚至在拐入大路时，都没有停下来。终于，你在一个街灯下，放慢了速度。
“狼人还在我们后边吗？”你喘着粗气问。
“不，”一个深沉而沙哑的声音回答道，“他就在你旁边！”
你扭头去看汤姆，立刻尖叫起来。他的脸转了过来，一张长满恶劣粗毛的狼脸！他的手变成了爪子，手指甲变成了尖尖的利爪。

请看输入数字75
''',
'page75':'''“啊！”卡琳惊叫一声，摔了个仰八叉。汤姆哈哈大笑，在街灯下，他呲出的利牙正逼近你的脖子……
''',
'page48':'''“别过去，那儿不安全。”你说。
“好，我们去找救兵。”卡琳说。然后，你俩没命地向家跑去。刚到家，已是上气不接下气了。可是，所有房间找个遍，都没找到汤姆和姨妈。
你和卡琳只好站在厨房的窗前，看着外面的倾盆大雨。天黑极了，偶尔有一两道闪电的亮光。
“也许我们该给警察打电话。”你说。
这时，厨房的门开了。

请输入数字53
''',
'page53':'''“嗨！”一个声音喊着，是汤姆，他浑身湿淋淋的，一副满不在乎的样子。
卡琳立刻跑上前去。“汤姆，你还好吧？”
“当然了，出了什么事儿吗？”他耸了耸肩说。
“我们在林子里看见你了。”卡琳说。
“你同狼人在一起，”你接着说。“后来，又发生了什么事儿？”
“我根本没跟狼人在一起过，”他解释说。“我只是在找线索。”
卡琳把两只手插进裤子的两个兜儿里，站在那儿，瞪着他。“汤姆，你能肯定你一直没有碰到过别人吗？”
“我不会骗你们，”他冷冷地说，“我现在要单独呆一会儿。”他转过身向楼上走去，只剩下你和卡琳呆呆地对望着。
“我似乎觉得，不该相信他的话。”你说。
“我也是。”卡琳说。“我敢发誓，路上看见的那个人肯定是汤姆。”
“我也发誓，另外一个肯定是狼人。”你补充道。
卡琳的脸色变得很难看。

请看输入数字41
''',
'page41':'''“你在想什么？”你问。
“也许狼人对汤姆做了什么手脚！”
“所以，他什么也不跟我们说？”
“也许更糟。”卡琳摇了摇头，她又开始浮想联翩了。
“你看该不该把这事儿告诉我妈妈呢？”她问。“我想，她该知道。但她又能怎么办呢？只是徒增烦恼而已。”

你如果说：“我们最好还是告诉她。”请输入数字76；
你如果说：“我认为，还是不告诉她好。”请输入数字51
'''
,
'page76':'''直到第二天，汤姆出门去仓库办事，你和卡琳才有机会把汤姆和狼人的事告诉夏洛蒂姨妈。
她推了一下眼镜，看着你，问：“这是真的吗？”
“是真的！”你俩肯定地说。
夏洛蒂姨妈转过身，对卡琳说，“我知道，你不会编造这种事来骗我，但这实在令人费解。我必须亲自问问汤姆。”
翌日，夏洛蒂姨妈和汤姆开车出去兜风。过了很久，他们仍旧没有回来，你和卡琳开始担心起来。一直到你听见夏洛蒂姨妈的车开进来，你才把悬着的一颗心放下来。你和卡琳准备去门口迎接他们。

请输入数字69
''',
'page69':'''你们还没走到门口，门就开了，夏洛蒂姨妈走了进来。你和卡琳都惊叫起来。夏洛蒂姨妈浑身长满了又粗又长的毛！嘴和脸也变成了一副狼的嘴脸！她笑眯眯的，但这不是人类的笑。她的牙变得又尖又长，舌头从嘴里伸出来。
“嗨，我的小甜心，”她用一种低沉而沙哑的声音说道。“我和汤姆一起度过了一段有趣的时光。咱们在一起也会这样的，会这样的。”
'''
,
'page51':'''你决定还是对姨妈瞒住一切为好。约摸过了一天，你高兴地发现自己对发生过的事能平静对待了，再也没有狼人的消息，汤姆看上去也完全正常。你有很多可玩的，去城里看电影，打垒球，逛公园……没时间再去想那些不快的事儿。
在你离开姨妈家的前一天晚上，汤姆和卡琳显得有点儿怪。最近，他俩总粘在一块儿，形影不离。汤姆看上去比以前邋遢多了，偶尔，眼里还闪过异样的光。而卡琳的声音变得有点儿不对劲儿，幸好，你开回家了。
那天晚上，房间里有蚊子嗡嗡地叫着，你难以入睡，好一会儿，才睡着，还做了一个可怕的梦。梦见有人正在摸你，耳边有呼出的热气。你醒了，或者说，你觉得你已醒来，一睁双眼，只见一张狼脸！你一翻身，感觉到爪子划破了你的脖子。

请看输入数字54
''',
'page54':'''这回，你真的惊醒了，你跳下床，毯子和枕头散落了一地。你站在那儿直摇头，庆幸噩梦已醒！
打开灯，房间里没有人。然后，你去洗漱间，照了照镜子。脖子上真的有血迹。你把它擦干净，可以清清楚楚看见抓伤的痕迹。
难道，噩梦是真的？一定是被狼人袭击了！想到这儿，你不禁尖叫了起来。但转念一 想，也许是被蚊子叮的呢，你又马上恢复了平静。被叮的地方很痒，你伸手挠了几下，嗯，一定是被蚊子叮的。
回房后，你一直开着灯，过了很久，你才关掉它，你终于又睡着了。
第二天早晨醒来，回想昨天晚上做的噩梦，只能想起只鳞片爪。由于整天想着狼人的事，你的精神一直处于高度紧张状态。你准备中午乘车回家，一切噩梦即将成为过去，所以，在下楼吃早餐时，你感觉心情愉快，精力充沛，如同大病初愈一样。

请看输入数字33
''',
'page33':'''你走进厨房，只有卡琳一个人，你起得太晚了。夏洛蒂姨妈已经开车走了，她一定有事儿出去了，也许是和汤姆一起去的。
“嗨！”卡琳说。
“嗨！”你没细愁她，而是盯着餐桌，上面有夏洛蒂姨妈准备好的米饭、香蕉、松糕和果汁。餐桌那头卡琳正在吃东西，那东西看上去很怪，你走近些，不可能！她正在吃一只老鼠！
她割下一只后腿，放进嘴里嚼着，就像嚼一只小虾或是一只小鸡崽儿。看着这一切，你觉得可怕极了，呆立在那儿挪不动步子。
更奇怪的是，你的恐惧感慢慢消失了。另一种感觉控制了你：老鼠看上去味道一定很棒！
''',
'page10':'''你和卡琳从哈德利小姐家出来，沿着路走着。一道闪电划过夜空，接着，远处雷声隆隆，暴风雨随时都会来临。但是你没心思想这些，只是一味地琢磨哈德利小姐的话，不知不觉，浑身发抖。一想起狼人，你就恨不得马上往家跑。但你不想让自己过于失态，只好加快了脚步。卡琳也加快了脚步，你想，她一定跟你一样，有同样的想法。
你路过通向保罗丁池塘的岔路口时，天已经差不多黑了，你只能看清一小段路，再往前看去就是一片黑暗了。突然，又是一个闪电。这一下，你们看见路上有两个人。一个看上去身形硕大，腰弯弯的，浑身长满了粗毛，而另一个是一个小男孩。

请输入数字37
''',
'page37':'''头顶响起了雷声，卡琳立刻抓紧你的胳膊。“是汤姆！”她喊，“跟狼人在一起！”
“你能肯定吗？”
“我自己的弟弟能不熟吗！”
“但……那个是狼人吗？”
“是！一定是他！”她快要哭了。又一个闪电，照亮了这两个人。
“汤姆！”卡琳喊。“汤姆！”雷声盖过了她的声音。
“汤姆！”
没人回答。
卡琳看着你，脸上是一幅吓坏的样子。她看上去着实吓得不轻，呆呆地站在那儿。这怎么能怪她呢？你想跑过去看汤姆，但又有些害怕。

如果你沿路跑过去看汤姆，请输入数字50；
如果你径自回家，请输入数字48
''',
'page50':'''“我想还是过去，看看会发生什么事儿？”你说着，沿着那条脏兮兮的小路跑过去，卡琳跟在你后头。
你们很快来到看见汤姆的地方，但是，连个人影儿都没有，没有汤姆，也没有狼人。这时，天已经黑了，朦胧的月光找着前面暗淡的路面。忽然，你又看见汤姆向你们跑过来，嘴里喊着什么，一声惊天动地的雷声淹没了他的喊声。

请看输入数字59
''',
'page59':'''接着，你又听见了他的喊声。“快跑！狼人抓住了我，但现在我逃走了！”说话间他已跑到你们跟前。这时，又是一道闪电，就在这一刹那间，你看见他的衣领上有血迹。
你们三人一起跑，你在前边领路。你们甚至在拐入大路时，都没有停下来。终于，你在一个街灯下，放慢了速度。
“狼人还在我们后边吗？”你喘着粗气问。
“不，”一个深沉而沙哑的声音回答道，“他就在你旁边！”
你扭头去看汤姆，立刻尖叫起来。他的脸转了过来，一张长满恶劣粗毛的狼脸！他的手变成了爪子，手指甲变成了尖尖的利爪。

请看输入数字75
''',
'page75':'''“啊！”卡琳惊叫一声，摔了个仰八叉。汤姆哈哈大笑，在街灯下，他呲出的利牙正逼近你的脖子……

''',
'page31':'''你说：“我跟汤姆去。”
卡琳说：“那好，祝你们一路顺风。”
汤姆先是睁大了眼睛，现出一副胆怯的样子。接着又拍拍胸脯说：“有什么可怕的，别担心！”然后，你俩出了大门口。
汤姆领着你沿着大路走，而后，你们又拐进了一条通向林子的小土道，它看上去又细又窄又僻静，上面布满车轱辘印儿。
“天知道这条道通到哪儿？”汤姆说，“反正我是头一次走。”
“是不是我们该查看一下这儿？”你建议道。
“哦，”汤姆说，“那个发现尸体的池塘就快到了”
你俩紧赶慢赶地往前走着，几分钟后，那个池塘出现在眼前。看上去，它方圆有150英尺，塘边的树上落满了乌鸦。
在池边有一块开阔平坦的绿地，有人用绳子把它圈了起来，并竖起了一块标牌，上书几个大字：“案发现场——请止步。”

请输入数字47
''',
'page47':'''“别过去了，”汤姆说，“要是我们越过那根绳子时被别人抓住，那就麻烦了。”
“没错儿。”你说道。
“那咱们就豁出去闯一下了？”他激动地说。
“不然的话，就再回那条小土道查查？”


如果你决定进入禁区，请输入数字60；
如果你决定回头查看林间小路，请输入数字58
''',
'page60':'''“我们还是进去看看吧，”你说。
你从绳子地下钻进去，为了找到线索，来来回回地搜寻着。汤姆则在林子与池塘之间的绿地上查了起来。不一会儿功夫，你来到了水边。
天空中，阴云快速移动着。起风了，池塘的水面上荡起一片片涟漪。你弯下腰，手指轻弹水花，嗬，好凉啊。不经意，你又看了一眼池塘，水那边好像还有一条路通向池塘。
汤姆喊你：“什么线索也没有，他们肯定仔细查过了。”
“那边还有一条路通到池塘，你知道吗？”你叫汤姆过来，“狼人可能顺那条路逃走了。”
汤姆顺着你手指的方向望去，“真的哎，我看见了，以前我真没注意过。”他说。“我们去查查那条路，怎么样？”
“行，”你说，“我从池塘左边绕过去，你从右边绕，这样，我们就能查个遍。”
汤姆点点头，你俩开始行动了。

请看输入数字26
''',
'page26':'''由于池塘边的林子很密，你们走得很慢，再加上遍地丛生的荆棘，真是寸步难行。
走了一半，你们不得不停了脚步，密密实实的灌木丛挡住了你们的去路。
你寻思着，是砍出一条路来进入林子？还是沿着池塘边艰难地走进去呢？
过了一会，忽然，你听见林子中有动静，听上去是什么东西在动的声音。你蹲下身子，仔细听。有人在后面朝你走过来，再仔细听，就是向你这边移动的声音！不是汤姆，他在那边那条路上。你吓得浑身发抖。你的后路已被截断了。
你可以在前面茂密的灌木丛中藏起来，可要是狼人来，这法儿就不灵了，它能听见你在动，或闻出你身上的味儿；或许你可以跳进池塘游走。

你想藏到灌木丛中，请输入数字22；
你想跳进池塘游走，请输入数字7
''',
'page22':'''你悄悄地爬进茂密的灌木丛中，尽量地不弄出声响。竖起耳朵，仔细听。静极了。没多久，脚步声又出现了。这次听起来，他像是朝左边走了。
你想：“没准儿走远了？”然而，你马上又听见了那声音，这次可是朝你这边走过来了。虽然看不见，但是你能感觉到——一定是个庞然大物，听起来不像是个人。
声音越来越近，你的心跳也越来越快了。它已近在眼前，一定知道你的藏身之处了！你吓得缩作一团，用两只胳膊护着头。
突然，它就站在了你面前！你闻到一股热烘烘、难闻的气味儿，它的大爪子抓住了你的胳膊。你用手护着脸，从手指缝儿间，你瞥见它的下巴快碰到你的脖子了。
“站住！”一个声音喊道。“回来！”
这畜生从你身边走开了。你战战兢兢地抬起头，看到一双驯良的棕色眼睛，原来是一只德国牧羊犬。在牧羊犬身后，站着个一脸严肃的警察。
你还活着，带着种噩梦初醒的感觉。
'''
,
'page7':'''你尽可能俯下身，跳进水里，水很凉。到了深水地方，你向对岸潜游过去。正是夏天，你只穿了件短袖T恤，还有一双破旧的运动鞋，在水里它们显得又湿又重。游了差不多一半，你只好缓一缓，喘口气。
就在这时，你感觉到一条腿一阵刺痛。原来只是只水龟在咬你！你一巴掌打掉水龟，然后，吃力地向最近的岸边游去，顾不得腿上的伤痛，也顾不得湿衣服的沉重了。
终于游到了岸边，嗯？这儿不正好是方才的案发现场吗？一名警察在“恭候”着你，他身边还有一只驯良的德国牧羊犬。
你爬上岸，浑身湿淋淋的，怪难受的，受伤的腿也阵阵作痛。那警察刚要张口呵斥你一顿，一眼看到你腿上的血迹，便打住了。
“我们得先治好你的腿，”他说，“过来！”

请输入数字46
'''
,
'page46':'''他把你带到他的巡逻车上，车上有消炎药和绷带，他给你简单包扎了一下，嘱咐你回家以后还要去医院看看。
你无精打采地回到了夏洛蒂姨妈家。家里一个人都没有，你换了一身干衣服，然后，从冰箱里拿了一瓶汽水，喝完之后，就躺在睡椅上休息，腿也觉得好多了。
几分钟之后，汤姆回来了。“嗨，你跑哪儿去了？”他问道。“我真怕狼人抓住你！”他看了看你腿上的绷带，“怎么弄的？”
“我被咬了。”
“不是被狼人吧？”他睁大了眼睛问。
“这可不能告诉你。”
“也让我看看伤口。”他凑了过来。
你拆开绷带，他打量着咬伤，伤口四周已经变得青紫、肿胀了。
“啊！”汤姆直往后退，从他的脸色可以看出，这令他作呕。“这真的不是狼人干的，对吗？”

请输入数字32
''',
'page32':'''“我倒希望没有被狼人咬过，”你说，然后装出一副着急的样子。“告诉我，伤口会怎么样？”
汤姆盯着你，过了一会儿，他又看了一眼你的腿。“真怪，”他说。“我从没见过像这样的伤口。”
“那是因为你从没被狼人咬过，”你说。“从来没有。”
他更加相信了，像一只受惊的兔子似地跳了起来，差点儿打翻了台灯。呆呆地站在那儿，看着你，不知道是不是该相信你。
现在，你觉得，汤姆真的有点被你吓住了。他站在那儿，看起来是那么地担心，你忍不住笑出了声。
“你笑什么？”他气哼哼地说。“我知道了，你不是被狼人咬的。”
“没错儿，”你说。“那不过是你的胡思乱想罢了。”

请输入数字9
''',
'page9':'''晚饭时，卡琳与你们讲了她与哈德利小姐的古怪谈话。你和汤姆讲了你们在保罗丁池塘的冒险经历。接着，每个人都编了一个关于狼人的故事，而实际上，大家都有点害怕，尤其是夏洛蒂姨妈。杀人犯毕竟还没抓到，到底是不是狼人呢？
“我看我们该干点儿别的，不要总想着狼人，弄得大家心惊胆战的。”夏洛蒂姨妈说。
“我们去看录像吧！”卡琳建议。
大家一致通过，碗都没洗，你们就一窝蜂似的上了车，夏洛蒂姨妈带你们去音响大世界。
刚到那儿，你们马上开始选片子。汤姆挑了一个片子，大家高兴得直拍手叫好，片名就叫《狼人之夜》。
夏洛蒂姨妈盯着片名说：“又来了，我本想让大家放松一下的。”
你、汤姆和卡琳都非要看这个，夏洛蒂姨妈只好租了这个片子。
到家之后，姨妈又爆了一些爆米花。一切准备停当，你们舒舒服服地坐在沙发上。汤姆关上灯，卡琳开始放录像。

请输入数字20
''',
'page20':'''电影开始了，一个森林的全景，一声凄厉的长嗥，在那森林中的某个地方，住着一个狼人！
录像机继续沙沙地转动着，影片中出现了一所房子，房子里住着一家人。大人和孩子们正围坐着看电视。刚才的声音又出现了，一个小女孩跑到窗前。
“什么声音？”她弟弟问。
“不知道。”父亲回答说。
小女孩往回走，这时，那声音又传来了，更近了。有敲门声，灯也开始在空中摇晃，忽明忽暗。
“谁？”男孩问。没有人回答。
敲门声，嗥叫声，不断地传来。
父亲准备下床。
母亲拿来她的拖鞋。“约翰，别去开门。给警察打电话！”
父亲抓起电话，拨了个号码。敲门声还在响个不停。突然，只听“哗啦”一声，门被劈开了！

请看输入数字56
''',
'page56':'''“太吓人了！”卡琳说。“别看了。”
“不，”汤姆大声抗议。“正看得来劲呢！”话音未落，耳边又传来一声凄厉的长嗥。
夏洛蒂姨妈警觉的坐直了身子，转过头，侧耳倾听：“是电影里的声音，还是我们树林里的声音？”
“是从我们树林里传来的，”汤姆说。“嗬，嗬，嗬，”他笑起来，还学着嗷嗷怪叫。

请看输入数字39
''',
'page39':'''“汤姆，别闹了！”卡琳喊着，抓起一个枕头，朝着弟弟的脸用力摔过去。汤姆抬起胳膊，挡住了飞过来的枕头。
“你俩都别闹了！”夏洛蒂姨妈喊。
又响起了嗥叫声。夏洛蒂姨妈起身，走到窗前，向外张望。“声音好像是从窗外传来的。”她说。
“也许狼人躲在屋外，偷听电影吧？”你说。
“那可就不是闹着玩的了，”卡琳说：“附近有人被杀，你们都忘了？”
影片中，一个虎背熊腰的庞然大物——狼人，突然冲进房子。他伸出长长的爪子，大嘴张着，露出尖尖的、带刺儿的獠牙。房子里的人都哆哆嗦嗦地躲在角落里。
“电话被切断了！”父亲喊。
“不会的！不会的！”母亲因惊恐而尖叫起来。
“快关上吧，行不行啊？”卡琳恳求道。
汤姆冲她喊，“你不愿意看，就上别的屋去！”又转过来问你：“你想接着看，对吧？”

如果你说“是”，请输入数字34；
如果你说“不”，请输入数字62
''',
'page34':'''“我们接着看吧。”你说。
夏洛蒂姨妈爱抚地拍拍卡琳的头，说：“宝贝儿，你要是不想看，回房间找本书看，怎么样？”
“好吧，我走！”卡琳嚷着跳下沙发，一阵风似的冲出了屋，连爆米花儿都忘记拿了，好像对它也讨厌起来。
你们三个人留下来，继续看电影：父亲拿起一把椅子，试图砸那个狼人。这时，灯全灭了，只有微弱的月光，但你们可以清清楚楚地看见狼人。它发出可怕的嗥叫声。突然，他转过身，向父亲扑去！

请输入数字55
''',
'page55':'''你心里想，这一定是一部恐怖片。这时，身后传来了拖鞋声。原来是卡琳，她又回来了，没有同你们一起坐在沙发上，而是自己拿着一碗爆米花，坐到角落里的一把椅子上去了，椅子上有一个厚厚的大垫子。看来，她还是挺想看这部片子的。
片子继续着：房子里的每一个人都在跑，想逃离狼人的魔掌。
咚！有什么东西打在你的头上，是爆米花儿，是卡琳打的。你被电影吸引住了，所以你没理她，汤姆和夏洛蒂姨妈也没理她。
“嗬，嗬，嗬，”卡琳大声地笑起来，笑喷了好几次，一边还大声地嚼着爆米花儿。
“嘘——”汤姆小声说。“小点声儿。”
这时，屏幕上一篇漆黑。而那可怕的声音却连续不断地传来，这不是从片子里发出的声音，而是从你们住的屋子里！
接着，满满一大碗爆米花从空中飞来，落在汤姆、夏洛蒂姨妈和你面前的空地上。

请输入数字63
''',
'page63':'''“我不要这个，要肉！”一个声音喊道。
夏洛蒂姨妈迅速打开灯，关掉电视。是狼人，他正坐在椅子上！你和汤姆畏缩在夏洛蒂姨妈身后。卡琳不见了！你们想，她是不是出事儿了？这个畜生，冲你们过来了，眼中闪过一丝邪恶。
''',
'page62':'''“不，我才不想看呢，关了吧。”你说。
“行了，就看到这儿。”夏洛蒂姨妈抓过遥控器关掉了电视。
这时，电话突然响了，把你们吓了一跳。
“喂？”夏洛蒂姨妈说。你们注视着她，只见她的嘴唇直发抖，“是真的？又一具尸体？”
她问，“也有巨大的齿痕？”
''',
'page58':'''“那咱们回那条小土道吧，也许会发现什么。”你说。
“行，听你的。”汤姆说道。
那条小道向林间深处延伸着，蜿蜒曲折，通向一座小山，路上布满各种足迹，崎岖不平，窄得连一辆小吉普都过不去。
前面不远处有一棵树横卧在路中间，你奔到它跟前，往前一看，前面人迹罕至，只有一行孤零零的印迹伸向前方。你们顺着印迹继续往前走，走着走着，在一片灌木堆前，它突然消失了。
“这是谁堆的呢？”你问。
汤姆耸耸肩，一副无奈的样子，“我敢肯定，我以前从没来过这儿。这看上去好像是个栅栏，是不是想把道拦住，不让人再往前走了？”
   “对，但这可挡不了我们。”你说，“过来！”于是，你绕过灌木丛走进林子。汤姆从另一边走过来，那印迹又出现了，但这里杂草丛生，不太好跟踪了。

请看输入数字70
''',
'page70':'''沿着印迹，你和汤姆继续向前走着，翻过一个高坡，走过一片洼地，又爬上了一座山坡。你累得直想停下来喘口气，忽然，远远地，一幢破旧的小木屋进入了视线。这屋子有门，有窗子，屋顶还有一个烟囱。
你有些紧张了，心怦怦直跳：这可能是狼人的家吧？你和汤姆慢慢向房子靠近，警觉地倾听四周的动静，那小心翼翼的样子就像森林中的小鹿。
屋顶一头长满了苔藓。小得可怜的窗子也用灰封上了。屋外墙上爬满了盘根错节的野藤，房子看上去并没有人居住。
“我想这幢房子现在没人住。”汤姆低声说。
“有没有人住，待会儿我们就能知道。”你说。但在内心里，你好像觉得事实正与汤姆说的相反。
你来到门前，门板已经让风雨侵蚀，扭曲变形了，门折叶也长满了锈。你壮着胆子轻轻地敲了敲门，做好准备逃跑的姿势，但是屋里什么动静也没有。你打开门闩，推开门，折叶发出吱吱的响声，好像已经多年没有上油了。

请看输入数字15
''',
'page15':'''你和汤姆一起走进房子。房子里有一个洗涤槽，一个火炉，一张床，一张桌子，一对靠背椅，这让你想起了夏洛蒂姨妈家的陈设。洗涤槽下面乱七八糟堆满了骨头，小的好像是小鸡或者是兔子的，还有一些大的。你目不转睛地看着，是什么呢？
汤姆呼吸急促起来，“那些是小鹿的骨头吧？还是……”
“人的。”你弯下身，仔细辨认着。
汤姆正凝视着窗外，突然，他惊呼起来：“他来了！”

请输入数字30
''',
'page30':'''从这扇脏透了的窗子向外看，什么都是模模糊糊的，但你能确定一点，有人正向这儿走过来。那人的头发、脖子、肩上都是长毛，头很平，又长又尖的嘴微微张着。噢，那牙齿，那嘴，它分明是一只狼人！
“我得出去！”汤姆喊着，冲出了门。
你必须在刹那间作出选择：要么你也冲出去，可汤姆是先跑的，狼人要来追的话，可能先追上你，逮住你；也可能这样：狼人在汤姆跑了之后就进屋，你藏到床底下去，等狼人再出去时，找个机会逃走。

如果你也像汤姆一样跑出去，请输入数字40；
如果你藏到床底下，请输入数字44
''',
'page40':'''你也毫不犹豫地跑出了这幢小房子，沿着崎岖不平的小径，拼命往前跑。而后面紧跟着传来了急促的脚步声，还夹杂着异样的声音，既不像狼嗥，也不像虎啸。
你拼命想跑得更快些，根本没有时间回头去看到底是谁在追你。你快追上汤姆了。顷刻间，你已到了他身后。“快！”你喊。
汤姆办侧过身子，突然，他的脚被野藤一绊，扑到在地上。你想，不能停下来，停下来就没命了。于是，你从他身上跳了过去。
这时，你和汤姆同时尖叫起来，感觉到被铁钳一样有力的手死死抓住。耳边扑来一股热气，这是狼人在喘气，还有那低沉、沙哑的嗥叫！他那长着獠牙的长下巴快碰到你的脖子了！
你挣扎着，想逃走，他却抓得更紧了。就这样，狼人一直拽着你俩。最后，你们筋疲力尽，吓得魂不附体，彻底绝望了。

请输入数字72
''',
'page72':'''乍一看那畜生，觉得它跟动物比起来，更像人类。再看它时，觉得它更像一只狼。听见它的声音，又让你吃了一惊，那声音低沉而沙哑。
“刚才你在我的房子里干什么了？”
“没……没……没干什么，”你说。“我们就是觉得好玩。”
“我们实在觉得很抱歉，真的。”汤姆说，他的声音有些发抖。

请输入数字43
''',
'page43':'''狼人稍稍松了松那两只抓着你们的爪子，可你们仍旧动不了。他闻了闻汤姆的脖子，接着又闻了闻你的，“呜呜”地低声嗥叫着，把你们吓得魂都丢了。
你尖叫起来，他赶忙捂你的嘴。
“我不会抓你俩的，”他说。“我打算放你们走，但是有一个条件。”
“什么条件我们都答应。”汤姆马上回答。
“小点声！”他吼起来。“我的条件是，你们必须把今天下午听到的、看到的，全都忘掉！”
“一定！”汤姆说。“我们一定会的！”
“是的，我们会的！”你也跟着喊起来。心里却在想，忘掉这件事，怎么可能呢？但这可不能跟狼人说。
“好。”他又松了松抓住你们的爪子。“你们要是还记得今天的事儿，那么……我们就还会再见面的，你们明白吗？”
“明白。”你和汤姆脱口而出。
“那么，给我滚！”

请输入数字61
''',
'page61':'''他松开了爪子。你和汤姆立刻拼命往回跑，一口气跑下小山坡儿，你们才停下来，大口大口地喘着粗气。直到远离狼人的视线，直到再也看不见他的小棚屋了。
你看了看汤姆，汤姆看了看你。
“刚才的事儿，我还是历历在目，你呢？”汤姆问。
“我怎么会忘？”你答道。
汤姆说：“那就是说，我们都没有按照它的话去做。”
“不管那么多，”你说，“它又不知道我们心里在想什么。”
你长出了一口气，准备重新上路。突然，你听见树枝沙沙作响，接着，传来狂怒的嗥叫声，经久不绝，而且越来越近！
你和汤姆彼此对视着，狼人不能猜透你的想法？或许能吧？！
''',
'page44':'''你想，如果跑，狼人肯定会抓住你，于是你藏到床底下。躲在那儿，屏住呼吸，竖耳倾听外面的动静。
外面怎么样了？狼人是不是正在追汤姆？但是，你什么也听不见，只听见一只乌鸦在呱呱地叫着。
时间就这样一分一秒地过去了。你躲在床底下等着，浑身是汗，你真后悔窝在这儿。不知道发生了什么，这是最让人害怕的。
于是，你从床底下钻出来，就在这时，你突然听见脚步声，吓得呆立在那儿。
传来了开门的动静，狼人回来了。他在屋里来回走动，没听见汤姆的声音，他一定是逃走了！
你吓得动弹不了，只有脑子在飞快地转着各种念头，再站在这儿，狼人一定会发现的。
那床很近，就在眼跟前儿，买一步就到。可是，弄出声响就糟了。
最后，你还是重新钻回床底下，而且，很庆幸，没有被发觉。
就在这时，你问到一股烟味，一定是他正在做饭，一股油腻腻的肉味飘来，可能他正在罐子里炖一只兔子。

请输入数字57
''',
'page57':'''你听见低沉而沙哑的声音，仿佛在哼唱着什么。这提醒了你，狼人看上去心情很好，是不是因为要吃饭了？
你听见他又在走动了，脚步声离床越来越近。
他停下来了，它要做什么？你想，可千万别看见我。
你听见“啊喔啊喔——”的声音，声音愈来愈响。然后，你感觉到两只铁钳般的爪子抓住你的胳膊，把你从床底下拽了出来。你抬起头，看见一张狼人的脸！
他立即把你举起来，放进椅子里，然后，把椅子推到桌前。桌上铺着一张刚剥下来的兔皮。冒着蒸气的壁炉上有个罐子——他在煮汤。
他用一只粗劣的木碗盛了些汤，然后，做在板凳上看你。
“我喜欢你。”他终于说。

请看输入数字78
''',
'page78':'''你顺从地点点头，没说话。你根本不在乎他喜欢与否，你是想逃走！“我现在可以走吗？”你问。
“呆一会儿。”他把碗推过来，“你先尝尝我做的汤。”
你向汤丽看去，连肉丝和骨头渣儿都没有，黑黑的，是碗清汤。“不，谢谢。”你说，试着把碗推回去。
他用打手挡住了，“尝尝！”他提高了嗓门儿说，“然后，我就让你走。”
你摇了摇头，你不想吃或者喝与他沾边的东西！

请输入数字11
''',
'page11':'''它怒视着你，舌头从它那大得吓人的牙齿后面伸出来。“你要想走，就得喝我做的汤！”听到这话，你真想把这碗汤泼到它脸上。
“你现在马上给我喝！”它尖叫着。
你一边畏缩着向后退，一边想，它会强迫你把汤全部喝掉，它却从罐子里拿出一条剩下的兔腿，啃起来。它一边啃，一边盯着你。
然后，它又把啃剩的骨头扔进罐子里，继续煮，继续盯着你，嘴里又开始发出轻微地呜呜声。它把碗推到你的鼻子底下。“你一定要喝！”他说，“快喝！”
一想起汤中的其他东西，你就感到恶心。但你想，如果不快点儿逃走，下碗汤就有可能是用你的骨头煮的！
要不你可能尝尝那碗汤？要不，你把这碗汤向它扔过去，逃之夭夭？

如果你喝汤，请输入数字35；
如果你把汤泼向狼人，逃走，请输入数字49
''',
'page35':'''“好吧，我喝。”你说。
“好样的，好样的。”他又发出轻微的呜呜声，像猫叫。他斜过身子，靠近你。你舔了舔嘴唇。这汤又腻又烫，还有点儿苦。很快，你就觉得头昏目眩。
“很好喝，是不是？”狼人说，“把剩下的喝光！”
“不，谢谢你，”你声音很低，“我觉得不太舒服。”
“滚吧！”突然，狼人喊道。他把门摔开，然后，冲你伸出爪子，好像要抓你的样子。而你早已出了大门，逃之夭夭了。
你一口气跑回夏洛蒂姨妈家。你为你的自由而兴奋，却又为喝了那碗汤而焦虑。你现在好多了，你喝那碗汤时，却有种很奇怪的感觉。汤里除了有兔子肉之外，还会有什么呢？这会对你有什么影响吗？
天知道！看起来，起码现在是不会有什么影响。第二天天还没亮的时候，你醒了，走到窗前，欣赏着月光。过了好久，你听见从自己的嘴里发出一声长长的，可怕的嗥叫声！
''',
'page49':'''你拿起那碗汤，迅速向他扔去。
他尖叫着，用手使劲揉擦着眼睛，那汤汁浓浓的，还很烫。你想马上跑，又禁不住回头看他：他那张毛脸渐渐地变成了人脸，他的牙也在变小，爪子逐渐变成人手。接着，你发现他正在哭！
你根本不知道，究竟是怎么回事儿？没时间去想了，你跑出门，以前所未有的速度拼命向前跑！
你连头都没有回一下，一直跑到夏洛蒂姨妈家，你上气不接下气了，但心里特别高兴。因为你战胜了狼人，相信他一定不敢再骚扰你了。
'''
}

print('''古代欧洲，爆发瘟疫，人们纷纷死去，一个叫做亚历山大·柯文纳斯的军头也感染了疾病，但只有他一个人活了下来。亚历山大的孩子一共有3位，不幸的是其中两位－马库斯与威廉，一个被蝙蝠咬伤，另一个却狼咬伤，只有一位作为普通人。两个兄弟由于病毒产生变异，一位成为吸血鬼的始祖，另一位成为狼人的始祖。从此狼人和吸血鬼便在欧洲流传开来……
许多年以后……''')
time.sleep(3)
num=input('''
回复1开始《狼人之夜》游戏。
>''')
goodend = [74,77,22,49]
badend = [52,75,69,33,75,63,62,61,35]
game=[]
time.sleep(1)
while True:

    game.append(num)
    print(superdict['page'+num])
    time.sleep(3)
    if int(num) in goodend:
        f = open('D:\\游戏记录.txt','a+')
        for x in game:
            f.write(superdict['page'+str(x)]+'\n\n')
            f.close
        input('''luck Dog!
恭喜你，成功通关本游戏。
游戏记录已保存至D盘根目录下！
点击Enter即可退出游戏~
注：游戏脚本出自《狼人之夜》。
原作者为汤姆·B·斯通（Tom B. Stone）。
>''')

        break
    if int(num) in badend:
        f = open('D:\\游戏记录.txt','a+')
        for x in game:
            f.write(superdict['page'+str(x)]+'\n\n')
            f.close
        input('''Bad Ending!
恭喜你，成功通关本游戏。
游戏记录已保存至D盘根目录下！
点击Enter即可退出游戏~
注：游戏脚本出自《狼人之夜》。
原作者为汤姆·B·斯通（Tom B. Stone）。
>''')
        break
    num = input('请输入数字编码：')